ngoKevinT/DrumLedController/_AI/src/lvgl/core_node/sdkconfig.defaults
# --- Target & Flash ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Partition Table ---
# Points ESP-IDF at partitions.csv in the project root.
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- PSRAM (Octal, 120 MHz) ---
# Required for the full-screen LVGL frame buffers on the 1024x600 display.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# --- FreeRTOS & Cache ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_FATFS_LFN_HEAP=y

# --- LVGL Core ---
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# --- LVGL Fonts (Montserrat built-in) ---
# These must be enabled for any lv_font_montserrat_XX reference in UI code.
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_USE_IMGFONT=y

# --- LVGL Filesystem (STDIO driver) ---
# Maps drive letter 'S' (ASCII 83) to /spiffs so image paths like
# "S:/wallpaper2.bin" and "S:/settings.png" resolve correctly.
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/spiffs"
CONFIG_LV_FS_STDIO_CACHE_SIZE=0

# --- PNG decoder ---
CONFIG_LV_USE_PNG=y
